Revit 2026 API

# MechanicalUtilsConvertDuctPlaceholders Method

---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> ConvertDuctPlaceholders(
	Document document,
	ICollection<ElementId> placeholderIds
)
```
```vb
Public Shared Function ConvertDuctPlaceholders (
	document As Document,
	placeholderIds As ICollection(Of ElementId)
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ ConvertDuctPlaceholders(
	Document^ document,
	ICollection<ElementId^>^ placeholderIds
)
```
```fsharp
static member ConvertDuctPlaceholders :
        document : Document *
        placeholderIds : ICollection<ElementId> -> ICollection<ElementId>
```

#### Parameters

document Document

placeholderIds ICollectionElementId

#### Return Value

ICollectionElementId

#### Reference

MechanicalUtils Class

Autodesk.Revit.DB.Mechanical Namespace